{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "LSTM", "config": {"trainable": true, "stateful": false, "batch_input_shape": [null, 60, 3], "unroll": false, "activation": "tanh", "implementation": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "unit_forget_bias": true, "return_state": false, "units": 150, "recurrent_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "dtype": "float32", "time_major": false, "use_bias": true, "name": "lstm_3", "dropout": 0.0, "return_sequences": false, "go_backwards": false, "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "units": 150, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "name": "dense_6", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "dtype": "float32", "activation": "softmax", "units": 4, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "name": "dense_7", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}}